app/Controllers/Eventos.php

SELECT *
FROM `tbl_cursos`
WHERE `event_id` = 7
ORDER BY `curso_titulo` ASC
 LIMIT 100
---
			 * Datas dos Workshops
			 * -------------------------------------------------------------
			**/
				$query_workshops = $this->cursoMD
					->where('event_id', $event_id)
					->orderBy('curso_titulo', 'ASC')
					->limit(100)
					->get();