app/Controllers/Inscricoes.php

	public function grupos( $event_hashkey = "" )
	{
		if( !session()->get('isLoggedInUserInscricao') == TRUE ){
			return $this->response->redirect( site_url('inscricoes/login/'. $event_hashkey) );
		}else{
			$user_id = (int)session()->get('inscUser_id');
		}
		if( empty($event_hashkey) ){
			return $this->response->redirect( site_url() );
		}

		/*
		 * -------------------------------------------------------------
		 * Informações do evento selecionado
		 * -------------------------------------------------------------
		**/
			$this->eventMD->from('tbl_eventos As EVENT', true)
				->select('INSTI.insti_urlpage')
				->select('EVENT.*')
				->join('tbl_instituicoes AS INSTI', 'INSTI.insti_id = EVENT.insti_id', 'INNER')
				->where('EVENT.event_hashkey', $event_hashkey)
				->orderBy('EVENT.event_id', 'DESC')
				->limit(1);
			$query_event = $this->eventMD->get();
---
SELECT `INSTI`.`insti_urlpage`, `EVENT`.*
FROM `tbl_eventos` As `EVENT`
INNER JOIN `tbl_instituicoes` AS `INSTI` ON `INSTI`.`insti_id` = `EVENT`.`insti_id`
WHERE `EVENT`.`event_hashkey` = '19ec236c67883adae1b3342a56baec8f'
ORDER BY `EVENT`.`event_id` DESC
 LIMIT 1

				 * Informações referente ao grupo e evento
				 * -------------------------------------------------------------
				**/
					$this->grpMD->from('tbl_grupos As GRP', true)
						->select('GRP.*')
						->select('GREVT.grevt_id')
						->join('tbl_grupos_x_eventos AS GREVT', 'GREVT.grp_id = GRP.grp_id', 'INNER')
						->where('GRP.user_id', $user_id)
						->where('GREVT.event_id', (int)$event_id)
						->orderBy('GREVT.grevt_id', 'DESC')
						->limit(1);
---
SELECT `GRP`.*, `GREVT`.`grevt_id`
FROM `tbl_grupos` As `GRP`
INNER JOIN `tbl_grupos_x_eventos` AS `GREVT` ON `GREVT`.`grp_id` = `GRP`.`grp_id`
WHERE `GRP`.`user_id` = 25
AND `GREVT`.`event_id` = 7
ORDER BY `GREVT`.`grevt_id` DESC
 LIMIT 1

				 * participantes já cadastrados
				 * -------------------------------------------------------------
				**/
					$query_partc_cadastrados = $this->partcMD->from('tbl_participantes As PARTC', true)
						->select('PARTC.*')
						->select('CAD.cad_nome, CAD.cad_documento, CAD.cad_genero, CAD.cad_dte_nascto,
							CAD.cad_file_foto, CAD.cad_file_doc_frente, CAD.cad_file_doc_verso,
							CAD.uf_id, CAD.munc_id')
						->select('CATEG.categ_titulo')
						->select('FUNC.func_titulo')
						->join('tbl_cadastros AS CAD', 'CAD.cad_id = PARTC.cad_id', 'INNER')
						->join('tbl_categorias AS CATEG', 'CATEG.categ_id = PARTC.categ_id', 'LEFT')
						->join('tbl_funcoes AS FUNC', 'FUNC.func_id = PARTC.func_id', 'LEFT')
						->where('PARTC.insti_id', (int)$insti_id)
						->where('PARTC.grp_id', (int)$grp_id)
						->where('PARTC.grevt_id', (int)$grevt_id)
						->orderBy('PARTC.partc_nome', 'ASC')
						->limit(1000)
						->get();
---
SELECT `PARTC`.*, `CAD`.`cad_nome`, `CAD`.`cad_documento`, `CAD`.`cad_genero`, `CAD`.`cad_dte_nascto`, `CAD`.`cad_file_foto`, `CAD`.`cad_file_doc_frente`, `CAD`.`cad_file_doc_verso`, `CAD`.`uf_id`, `CAD`.`munc_id`, `CATEG`.`categ_titulo`, `FUNC`.`func_titulo`
FROM `tbl_participantes` As `PARTC`
INNER JOIN `tbl_cadastros` AS `CAD` ON `CAD`.`cad_id` = `PARTC`.`cad_id`
LEFT JOIN `tbl_categorias` AS `CATEG` ON `CATEG`.`categ_id` = `PARTC`.`categ_id`
LEFT JOIN `tbl_funcoes` AS `FUNC` ON `FUNC`.`func_id` = `PARTC`.`func_id`
WHERE `PARTC`.`insti_id` = 1
AND `PARTC`.`grp_id` = 1
AND `PARTC`.`grevt_id` = 1
ORDER BY `PARTC`.`partc_nome` ASC
 LIMIT 1000

	public function doacoes( $grevt_hashkey = "" )
	{
		if( !session()->get('isLoggedInUserInscricao') == TRUE ){
			return $this->response->redirect( site_url('inscricoes/error') );
		}
		$user_id = (int)session()->get('inscUser_id');

		//print '<h1>grevt_hashkey:'. $grevt_hashkey .'</h1>';
		$this->autzMD->from('tbl_grupos_x_eventos AS GREVT', true)
			->select('GREVT.grevt_id, GREVT.grevt_hashkey, ')
			->select('EVET.event_id, EVET.event_hashkey, EVET.event_titulo,')
			->select('GRP.grp_hashkey, GRP.grp_titulo')
			->join('tbl_eventos AS EVET', 'EVET.event_id = GREVT.event_id')
			->join('tbl_grupos AS GRP', 'GRP.grp_id = GREVT.grp_id')
			->where('GREVT.grevt_hashkey', $grevt_hashkey);
		$this->autzMD->groupBy('GREVT.grevt_hashkey, GRP.grp_titulo')
			->orderBy('EVET.event_id', 'ASC')
			->orderBy('GRP.grp_id', 'ASC')
			->limit(1);
		$query_infos_grupo = $this->autzMD->get();
---
SELECT `GREVT`.`grevt_id`, `GREVT`.`grevt_hashkey`, `EVET`.`event_id`, `EVET`.`event_hashkey`, `EVET`.`event_titulo`, `GRP`.`grp_hashkey`, `GRP`.`grp_titulo`
FROM `tbl_grupos_x_eventos` AS `GREVT`
JOIN `tbl_eventos` AS `EVET` ON `EVET`.`event_id` = `GREVT`.`event_id`
JOIN `tbl_grupos` AS `GRP` ON `GRP`.`grp_id` = `GREVT`.`grp_id`
WHERE `GREVT`.`grevt_hashkey` = '6d1c5fba39e8f332d8b4ff9d4859571f'
GROUP BY `GREVT`.`grevt_hashkey`, `GRP`.`grp_titulo`
ORDER BY `EVET`.`event_id` ASC, `GRP`.`grp_id` ASC
 LIMIT 1

	public function status( $grevt_hashkey = "" )
	{
		if( !session()->get('isLoggedInUserInscricao') == TRUE ){
			return $this->response->redirect( site_url('inscricoes/error') );
		}
		$user_id = (int)session()->get('inscUser_id');

		/*
		 * -------------------------------------------------------------
		 * Informações principais do evento
		 * -------------------------------------------------------------
		**/
			$this->autzMD->from('tbl_grupos_x_eventos AS GREVT', true)
				->select('GREVT.grevt_id, GREVT.grevt_hashkey, ')
				->select('EVET.event_id, EVET.event_hashkey, EVET.event_titulo,')
				->select('GRP.grp_hashkey, GRP.grp_titulo')
				->join('tbl_eventos AS EVET', 'EVET.event_id = GREVT.event_id')
				->join('tbl_grupos AS GRP', 'GRP.grp_id = GREVT.grp_id')
				->where('GREVT.grevt_hashkey', $grevt_hashkey);
			$this->autzMD->groupBy('GREVT.grevt_hashkey, GRP.grp_titulo')
				->orderBy('EVET.event_id', 'ASC')
				->orderBy('GRP.grp_id', 'ASC')
				->limit(1);
			$query_infos_grupo = $this->autzMD->get();
---
SELECT `GREVT`.`grevt_id`, `GREVT`.`grevt_hashkey`, `EVET`.`event_id`, `EVET`.`event_hashkey`, `EVET`.`event_titulo`, `GRP`.`grp_hashkey`, `GRP`.`grp_titulo`
FROM `tbl_grupos_x_eventos` AS `GREVT`
JOIN `tbl_eventos` AS `EVET` ON `EVET`.`event_id` = `GREVT`.`event_id`
JOIN `tbl_grupos` AS `GRP` ON `GRP`.`grp_id` = `GREVT`.`grp_id`
WHERE `GREVT`.`grevt_hashkey` = '6d1c5fba39e8f332d8b4ff9d4859571f'
GROUP BY `GREVT`.`grevt_hashkey`, `GRP`.`grp_titulo`
ORDER BY `EVET`.`event_id` ASC, `GRP`.`grp_id` ASC
 LIMIT 1

	public function fct_coreografias_cadastradas( $insti_id = '', $grp_id = '', $event_id = '' )
	{
		/*
		 * -------------------------------------------------------------
		 * Coreografias Cadastradas
		 * -------------------------------------------------------------
		**/
		$this->corgfMD->from('tbl_coreografias CORF', true)
			->select('CORF.*')
			->select('MODL.modl_titulo')
			->select('FORMT.formt_titulo')
			->select('CATEG.categ_titulo')
			->join('tbl_modalidades MODL', 'MODL.modl_id = CORF.modl_id', 'LEFT')
			->join('tbl_formatos FORMT', 'FORMT.formt_id = CORF.formt_id', 'LEFT')
			->join('tbl_categorias CATEG', 'CATEG.categ_id = CORF.categ_id', 'LEFT')
			->where('CORF.insti_id', (int)$insti_id)
			->where('CORF.grp_id', (int)$grp_id)
			->orderBy('CORF.corgf_id', 'ASC')
			->limit(200);
		$query = $this->corgfMD->get();
---
SELECT `CORF`.*, `MODL`.`modl_titulo`, `FORMT`.`formt_titulo`, `CATEG`.`categ_titulo`
FROM `tbl_coreografias` `CORF`
LEFT JOIN `tbl_modalidades` `MODL` ON `MODL`.`modl_id` = `CORF`.`modl_id`
LEFT JOIN `tbl_formatos` `FORMT` ON `FORMT`.`formt_id` = `CORF`.`formt_id`
LEFT JOIN `tbl_categorias` `CATEG` ON `CATEG`.`categ_id` = `CORF`.`categ_id`
WHERE `CORF`.`insti_id` = 1
AND `CORF`.`grp_id` = 5
ORDER BY `CORF`.`corgf_id` ASC
 LIMIT 200

	public function fct_elenco_por_coreografia( $corgf_id = '', $event_id = 0,  $forma_cobranca = [])
	{
		/*
		 * -------------------------------------------------------------
		 * Elenco Relacionado
		 * -------------------------------------------------------------
		**/
		$this->crfpaMD->from('tbl_coreografias_x_participantes CRFPA', true)
			->select('PARTC.partc_id, PARTC.partc_hashkey, PARTC.partc_nome, PARTC.partc_documento ')
			->select('FUNC.func_id, FUNC.func_titulo')
			->join('tbl_participantes PARTC', 'PARTC.partc_id = CRFPA.partc_id', 'INNER')
			->join('tbl_funcoes AS FUNC', 'FUNC.func_id = PARTC.func_id', 'INNER')
			->where('CRFPA.corgf_id', (int)$corgf_id)
			->orderBy('PARTC.partc_nome', 'ASC')
			->limit(100);
		$query = $this->crfpaMD->get();
---
SELECT `PARTC`.`partc_id`, `PARTC`.`partc_hashkey`, `PARTC`.`partc_nome`, `PARTC`.`partc_documento`, `FUNC`.`func_id`, `FUNC`.`func_titulo`
FROM `tbl_coreografias_x_participantes` `CRFPA`
INNER JOIN `tbl_participantes` `PARTC` ON `PARTC`.`partc_id` = `CRFPA`.`partc_id`
INNER JOIN `tbl_funcoes` AS `FUNC` ON `FUNC`.`func_id` = `PARTC`.`func_id`
WHERE `CRFPA`.`corgf_id` = 6
ORDER BY `PARTC`.`partc_nome` ASC
 LIMIT 100

	public function fct_sendmail_autorizacoes( $args = []  )
	{
		$partc_hashkey = (isset($args['partc_hashkey']) ? $args['partc_hashkey'] : '');
		$grevt_hashkey = (isset($args['grevt_hashkey']) ? $args['grevt_hashkey'] : '');

		$BANNER_DO_FESTIVAL = 'https://misterlab.com.br/jafeston/public/files-upload/ballerina-dance-academy__banner__1701865173_2fMu.jpg';
		if( !empty($partc_hashkey) && !empty($grevt_hashkey) ){
			/*
			SELECT EVTAUT.event_id, AUT.* FROM tbl_eventos_autorizacoes EVTAUT
				INNER JOIN tbl_autorizacoes AUT ON AUT.autz_id = EVTAUT.autz_id
			WHERE EVTAUT.event_id = 8;

			SELECT EVTAUT.event_id, AUT.* FROM tbl_eventos_autorizacoes EVTAUT
				INNER JOIN tbl_autorizacoes AUT ON AUT.autz_id = EVTAUT.autz_id
				INNER JOIN tbl_eventos EVET ON EVET.event_id = EVTAUT.event_id
			WHERE EVET.event_hashkey = '19ec236c67883adae1b3342a56baec8f';
			*/

			$this->grpMD->from('tbl_grupos As GRP', true)
				->select('GREVT.grevt_id')
				->select('GRP.*')
				->select('EVENT.*')
				->join('tbl_grupos_x_eventos AS GREVT', 'GREVT.grp_id = GRP.grp_id', 'INNER')
				->join('tbl_eventos AS EVENT', 'EVENT.event_id = GREVT.event_id', 'INNER')
				->where('GREVT.grevt_hashkey', $grevt_hashkey)
				->orderBy('GREVT.grevt_id', 'DESC')
				->limit(1);
			$query_grupo_evt = $this->grpMD->get();
---
SELECT `GREVT`.`grevt_id`, `GRP`.*, `EVENT`.*
FROM `tbl_grupos` As `GRP`
INNER JOIN `tbl_grupos_x_eventos` AS `GREVT` ON `GREVT`.`grp_id` = `GRP`.`grp_id`
INNER JOIN `tbl_eventos` AS `EVENT` ON `EVENT`.`event_id` = `GREVT`.`event_id`
WHERE `GREVT`.`grevt_hashkey` = '6d1c5fba39e8f332d8b4ff9d4859571f'
ORDER BY `GREVT`.`grevt_id` DESC
 LIMIT 1

				$event_hashkey = $rs_grupo_evt->event_hashkey;
			}

			$this->autzMD->from('tbl_autorizacoes AUT', true)
				->select('EVTAUT.event_id')
				->select('AUT.*')
				->join('tbl_eventos_autorizacoes AS EVTAUT', 'EVTAUT.autz_id = AUT.autz_id', 'INNER')
				->join('tbl_eventos EVET', 'EVET.event_id = EVTAUT.event_id', 'INNER')
				->where('EVET.event_hashkey', $event_hashkey);
			$query_autorizacoes = $this->autzMD->get();
---
SELECT `EVTAUT`.`event_id`, `AUT`.*
FROM `tbl_autorizacoes` `AUT`
INNER JOIN `tbl_eventos_autorizacoes` AS `EVTAUT` ON `EVTAUT`.`autz_id` = `AUT`.`autz_id`
INNER JOIN `tbl_eventos` `EVET` ON `EVET`.`event_id` = `EVTAUT`.`event_id`
WHERE `EVET`.`event_hashkey` = '19ec236c67883adae1b3342a56baec8f'
SELECT *
FROM `tbl_eventos`
WHERE `event_hashkey` = '19ec236c67883adae1b3342a56baec8f'
 LIMIT 1