app/Controllers/Renderimage.php

	public function view_grupos( $grp_hashkey = "",$filename = "" )
	{
		$path_folder_grupo = "";

		//$grp_hashkey = '9b3098ccee8fa94b8b6cb5bdef80ae15';

		$grpMD = new \App\Models\GruposModel();
		$grpMD->from('tbl_grupos GRP', true)
			->select('GRP.grp_urlpage')
			->select('EVENT.event_urlpage')
			->select('INSTI.insti_urlpage')
			->select('EVENT.event_urlpage')
			->join('tbl_grupos_x_eventos GRPEVT', 'GRPEVT.grp_id = GRP.grp_id', 'INNER')
			->join('tbl_eventos EVENT', 'EVENT.event_id = GRPEVT.event_id', 'INNER')
			->join('tbl_instituicoes INSTI', 'INSTI.insti_id = GRP.insti_id', 'INNER')
			->where('GRP.grp_hashkey', $grp_hashkey)
			->orderBy('GRP.grp_id', 'ASC')
			->limit(1);
		$query_folder_grupo = $grpMD->get();
---
SELECT `GRP`.`grp_urlpage`, `EVENT`.`event_urlpage`, `INSTI`.`insti_urlpage`, `EVENT`.`event_urlpage`
FROM `tbl_grupos` `GRP`
INNER JOIN `tbl_grupos_x_eventos` `GRPEVT` ON `GRPEVT`.`grp_id` = `GRP`.`grp_id`
INNER JOIN `tbl_eventos` `EVENT` ON `EVENT`.`event_id` = `GRPEVT`.`event_id`
INNER JOIN `tbl_instituicoes` `INSTI` ON `INSTI`.`insti_id` = `GRP`.`insti_id`
WHERE `GRP`.`grp_hashkey` = '6ab5d8ec8ea669371af490d66015bd2c'
ORDER BY `GRP`.`grp_id` ASC
 LIMIT 1