app/Controllers/Painel/Eventos.php

SELECT `GRUPO`.`autz_id`, `GRUPO`.`autz_parent_id`, `GRUPO`.`autz_hashkey`, `GRUPO`.`autz_titulo`, `GRUPO`.`autz_descricao`, `ITENS`.`autz_titulo` As `autz_titulo_parent`
FROM `tbl_autorizacoes` `GRUPO`
LEFT JOIN `tbl_autorizacoes` `ITENS` ON `GRUPO`.`autz_parent_id` = `ITENS`.`autz_id`
ORDER BY `GRUPO`.`autz_id` ASC, `GRUPO`.`autz_parent_id` ASC
 LIMIT 1000
---



		$this->autzMD->from('tbl_autorizacoes GRUPO', true)
			->select('GRUPO.autz_id, GRUPO.autz_parent_id, GRUPO.autz_hashkey, GRUPO.autz_titulo, GRUPO.autz_descricao')
			->select('ITENS.autz_titulo As autz_titulo_parent')
			->join('tbl_autorizacoes ITENS', 'GRUPO.autz_parent_id = ITENS.autz_id', 'LEFT')
			->orderBy('GRUPO.autz_id', 'ASC')
			->orderBy('GRUPO.autz_parent_id', 'ASC')
			->limit(1000);