app/Controllers/Painel/Workshops.php

		}


		$query = $this->cursoMD->where('curso_id', $curso_id)->get();
---
SELECT *
FROM `tbl_cursos`
WHERE `curso_id` = '5'