app/Models/EstadosModel.php

SELECT `uf_id`, `uf_nome`, `uf_sigla`
FROM `tbl_estados`
ORDER BY `uf_nome` ASC
 LIMIT 1000
---
	public function select_all()
	{
		$builder = $this->db->table( $this->table );
		$builder->select('uf_id, uf_nome, uf_sigla');
		$builder->orderBy('uf_nome', 'ASC');
		$builder->limit(1000);
		$query = $builder->get();