app/Models/EventosConfigModel.php

	public function get_by_id( $event_id = 0 )
	{
		$builder = $this->db->table( $this->table );
		$builder->select('*');
		$builder->where('event_id', (int)$event_id);
		$builder->orderBy('event_id', 'DESC');
		$builder->limit(1);
		$query_event_config = $builder->get();
---
SELECT *
FROM `tbl_eventos_config`
WHERE `event_id` = 7
ORDER BY `event_id` DESC
 LIMIT 1