app/Models/FormatosModel.php

	public function select_all_by_insti_id( $insti_id = 0 )
	{
		$builder = $this->db->table( $this->table );
		$builder->select('*');
		$builder->where('insti_id', (int)$insti_id);
		$builder->orderBy('formt_titulo', 'ASC');
		//$builder->limit(1);
		$query = $builder->get();
---
SELECT *
FROM `tbl_formatos`
WHERE `insti_id` = 1
ORDER BY `formt_titulo` ASC