app/Models/FuncoesModel.php

	public function select_all()
	{
		$builder = $this->db->table( $this->table );
		$builder->select('*');
		$builder->where('func_ativo', 1);
		$builder->orderBy('func_titulo', 'ASC');
		$builder->limit(1000);
		$query = $builder->get();
---
SELECT *
FROM `tbl_funcoes`
WHERE `func_ativo` = 1
ORDER BY `func_titulo` ASC
 LIMIT 1000