app/Models/ModalidadesModel.php

SELECT *
FROM `tbl_modalidades`
WHERE `insti_id` = 1
ORDER BY `modl_titulo` ASC
---
	public function select_all_by_insti_id( $insti_id = 0 )
	{
		$builder = $this->db->table( $this->table );
		$builder->select('*');
		$builder->where('insti_id', (int)$insti_id);
		$builder->orderBy('modl_titulo', 'ASC');
		//$builder->limit(1);
		$query = $builder->get();