app/Libraries/GenericLib.php

	public function get_folder_grupo( $args = [] )
	{
		$path_folder_grupo = "";

		$grp_id = (int)(isset($args['grp_id']) ? $args['grp_id'] : '');

		$grpMD = new \App\Models\GruposModel();
		$grpMD->from('tbl_grupos GRP', true)
			->select('GRP.grp_urlpage')
			->select('EVENT.event_urlpage')
			->select('INSTI.insti_urlpage')
			->select('EVENT.event_urlpage')
			->join('tbl_grupos_x_eventos GRPEVT', 'GRPEVT.grp_id = GRP.grp_id', 'INNER')
			->join('tbl_eventos EVENT', 'EVENT.event_id = GRPEVT.event_id', 'INNER')
			->join('tbl_instituicoes INSTI', 'INSTI.insti_id = GRP.insti_id', 'INNER')
			//->where('PARTC.insti_id', (int)$this->session_user_id)
			//->where('GRP.grp_hashkey', $_grp_hashkey)
			->where('GRP.grp_id', (int)$grp_id)
			->orderBy('GRP.grp_id', 'ASC')
			->limit(1);
		$query_folder_grupo = $grpMD->get();
---
SELECT `GRP`.`grp_urlpage`, `EVENT`.`event_urlpage`, `INSTI`.`insti_urlpage`, `EVENT`.`event_urlpage`
FROM `tbl_grupos` `GRP`
INNER JOIN `tbl_grupos_x_eventos` `GRPEVT` ON `GRPEVT`.`grp_id` = `GRP`.`grp_id`
INNER JOIN `tbl_eventos` `EVENT` ON `EVENT`.`event_id` = `GRPEVT`.`event_id`
INNER JOIN `tbl_instituicoes` `INSTI` ON `INSTI`.`insti_id` = `GRP`.`insti_id`
WHERE `GRP`.`grp_id` = 5
ORDER BY `GRP`.`grp_id` ASC
 LIMIT 1